### Terraform Plan 📦
```
[command]/home/runner/work/_temp/9c6a3f23-8ca3-42fa-a137-7524a9dadac5/terraform-bin plan -no-color -var-file=dev.tfvars
Acquiring state lock. This may take a few moments...
aws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2]
aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E19903IBB66DDO]
data.aws_route53_zone.route53_existing_zone: Reading...
aws_dynamodb_table.tf_rock: Refreshing state... [id=Terraform_LockTable_20251021]
module.static_site_bucket.aws_s3_bucket.static_site: Refreshing state... [id=terraform-staticsite-20251021]
aws_s3_bucket.s3_terraform_statefile: Refreshing state... [id=terraform-statefile-20251021]
data.aws_route53_zone.route53_existing_zone: Read complete after 0s [id=Z087900818DA70F3QYIWE]
aws_route53_record.cert_validation["_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."]: Refreshing state... [id=Z087900818DA70F3QYIWE__c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com._CNAME]
aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2025-10-28 12:26:19.465 +0000 UTC]
aws_s3_bucket_versioning.s3_terraform_statefile_versioning: Refreshing state... [id=terraform-statefile-20251021]
module.static_site_bucket.aws_s3_bucket_public_access_block.static_site: Refreshing state... [id=terraform-staticsite-20251021]
module.static_site_bucket.aws_s3_bucket_website_configuration.static_site_config: Refreshing state... [id=terraform-staticsite-20251021]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3PAZUZDPNT35E]
module.static_site_bucket.aws_s3_bucket_policy.static_site_policy: Refreshing state... [id=terraform-staticsite-20251021]
aws_route53_record.cloudfront_alias: Refreshing state... [id=Z087900818DA70F3QYIWE_dev.static.fieldwork48.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.virginia_cert must be replaced
+/- resource "aws_acm_certificate" "virginia_cert" {
      ~ arn                       = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply)
      ~ domain_name               = "*.static.fieldwork48.com" -> "*.development.fieldwork48.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.static.fieldwork48.com"
              - resource_record_name  = "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_70f239b75f7b0e7da71fbe1a6ad287c7.jkddzztszm.acm-validations.aws."
            },
          + {
              + domain_name           = "*.development.fieldwork48.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-26T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-28T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.static.fieldwork48.com",
          + "*.development.fieldwork48.com",
        ]
        tags                      = {
            "Env"     = "dev"
            "Name"    = "terrademo1-dev-wildcard-sslcert"
            "Project" = "terrademo1"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # aws_acm_certificate_validation.cert_validation must be replaced
-/+ resource "aws_acm_certificate_validation" "cert_validation" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply) # forces replacement
      ~ id                      = "2025-10-28 12:26:19.465 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ aliases                         = [
          - "dev.static.fieldwork48.com",
          + "dev.development.fieldwork48.com",
        ]
        id                              = "E3PAZUZDPNT35E"
        tags                            = {
            "Environment" = "dev"
        }
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_route53_record.cert_validation["0"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z087900818DA70F3QYIWE"
    }

  # aws_route53_record.cert_validation["_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."] will be destroyed
  # (because key ["_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."] is not in for_each map)
  - resource "aws_route53_record" "cert_validation" {
      - fqdn                             = "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com" -> null
      - id                               = "Z087900818DA70F3QYIWE__c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com" -> null
      - records                          = [
          - "_70f239b75f7b0e7da71fbe1a6ad287c7.jkddzztszm.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z087900818DA70F3QYIWE" -> null
        # (2 unchanged attributes hidden)
    }

  # module.static_site_bucket.aws_s3_bucket.static_site will be updated in-place
  ~ resource "aws_s3_bucket" "static_site" {
        id                          = "terraform-staticsite-20251021"
      ~ tags                        = {
            "Environment" = "dev"
            "Project"     = "terrademo1"
          ~ "dummy"       = "dummy01" -> "dummy03"
        }
      ~ tags_all                    = {
          ~ "dummy"       = "dummy01" -> "dummy03"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Aaws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2]%0Aaws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E19903IBB66DDO]%0Adata.aws_route53_zone.route53_existing_zone: Reading...%0Aaws_dynamodb_table.tf_rock: Refreshing state... [id=Terraform_LockTable_20251021]%0Amodule.static_site_bucket.aws_s3_bucket.static_site: Refreshing state... [id=terraform-staticsite-20251021]%0Aaws_s3_bucket.s3_terraform_statefile: Refreshing state... [id=terraform-statefile-20251021]%0Adata.aws_route53_zone.route53_existing_zone: Read complete after 0s [id=Z087900818DA70F3QYIWE]%0Aaws_route53_record.cert_validation["_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."]: Refreshing state... [id=Z087900818DA70F3QYIWE__c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com._CNAME]%0Aaws_acm_certificate_validation.cert_validation: Refreshing state... [id=2025-10-28 12:26:19.465 +0000 UTC]%0Aaws_s3_bucket_versioning.s3_terraform_statefile_versioning: Refreshing state... [id=terraform-statefile-20251021]%0Amodule.static_site_bucket.aws_s3_bucket_public_access_block.static_site: Refreshing state... [id=terraform-staticsite-20251021]%0Amodule.static_site_bucket.aws_s3_bucket_website_configuration.static_site_config: Refreshing state... [id=terraform-staticsite-20251021]%0Aaws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3PAZUZDPNT35E]%0Amodule.static_site_bucket.aws_s3_bucket_policy.static_site_policy: Refreshing state... [id=terraform-staticsite-20251021]%0Aaws_route53_record.cloudfront_alias: Refreshing state... [id=Z087900818DA70F3QYIWE_dev.static.fieldwork48.com_A]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate.virginia_cert must be replaced%0A+/- resource "aws_acm_certificate" "virginia_cert" {%0A      ~ arn                       = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply)%0A      ~ domain_name               = "*.static.fieldwork48.com" -> "*.development.fieldwork48.com" # forces replacement%0A      ~ domain_validation_options = [%0A          - {%0A              - domain_name           = "*.static.fieldwork48.com"%0A              - resource_record_name  = "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_70f239b75f7b0e7da71fbe1a6ad287c7.jkddzztszm.acm-validations.aws."%0A            },%0A          + {%0A              + domain_name           = "*.development.fieldwork48.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      ~ id                        = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply)%0A      ~ key_algorithm             = "RSA_2048" -> (known after apply)%0A      ~ not_after                 = "2026-11-26T23:59:59Z" -> (known after apply)%0A      ~ not_before                = "2025-10-28T00:00:00Z" -> (known after apply)%0A      ~ pending_renewal           = false -> (known after apply)%0A      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)%0A      ~ renewal_summary           = [] -> (known after apply)%0A      ~ status                    = "ISSUED" -> (known after apply)%0A      ~ subject_alternative_names = [ # forces replacement%0A          - "*.static.fieldwork48.com",%0A          + "*.development.fieldwork48.com",%0A        ]%0A        tags                      = {%0A            "Env"     = "dev"%0A            "Name"    = "terrademo1-dev-wildcard-sslcert"%0A            "Project" = "terrademo1"%0A        }%0A      ~ type                      = "AMAZON_ISSUED" -> (known after apply)%0A      ~ validation_emails         = [] -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A%0A      ~ options (known after apply)%0A      - options {%0A          - certificate_transparency_logging_preference = "ENABLED" -> null%0A          - export                                      = "DISABLED" -> null%0A        }%0A    }%0A%0A  # aws_acm_certificate_validation.cert_validation must be replaced%0A-/+ resource "aws_acm_certificate_validation" "cert_validation" {%0A      ~ certificate_arn         = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply) # forces replacement%0A      ~ id                      = "2025-10-28 12:26:19.465 +0000 UTC" -> (known after apply)%0A      ~ validation_record_fqdns = [%0A          - "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com",%0A        ] -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_cloudfront_distribution.s3_distribution will be updated in-place%0A  ~ resource "aws_cloudfront_distribution" "s3_distribution" {%0A      ~ aliases                         = [%0A          - "dev.static.fieldwork48.com",%0A          + "dev.development.fieldwork48.com",%0A        ]%0A        id                              = "E3PAZUZDPNT35E"%0A        tags                            = {%0A            "Environment" = "dev"%0A        }%0A        # (23 unchanged attributes hidden)%0A%0A      ~ viewer_certificate {%0A          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:903636036611:certificate/4e209df2-11aa-4c03-aea6-38aa842337a2" -> (known after apply)%0A            # (4 unchanged attributes hidden)%0A        }%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_route53_record.cert_validation["0"] will be created%0A  + resource "aws_route53_record" "cert_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z087900818DA70F3QYIWE"%0A    }%0A%0A  # aws_route53_record.cert_validation["_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."] will be destroyed%0A  # (because key ["_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com."] is not in for_each map)%0A  - resource "aws_route53_record" "cert_validation" {%0A      - fqdn                             = "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com" -> null%0A      - id                               = "Z087900818DA70F3QYIWE__c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com._CNAME" -> null%0A      - multivalue_answer_routing_policy = false -> null%0A      - name                             = "_c6666878109224c8adfce32dbd14eb7e.static.fieldwork48.com" -> null%0A      - records                          = [%0A          - "_70f239b75f7b0e7da71fbe1a6ad287c7.jkddzztszm.acm-validations.aws.",%0A        ] -> null%0A      - ttl                              = 60 -> null%0A      - type                             = "CNAME" -> null%0A      - zone_id                          = "Z087900818DA70F3QYIWE" -> null%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.static_site_bucket.aws_s3_bucket.static_site will be updated in-place%0A  ~ resource "aws_s3_bucket" "static_site" {%0A        id                          = "terraform-staticsite-20251021"%0A      ~ tags                        = {%0A            "Environment" = "dev"%0A            "Project"     = "terrademo1"%0A          ~ "dummy"       = "dummy01" -> "dummy03"%0A        }%0A      ~ tags_all                    = {%0A          ~ "dummy"       = "dummy01" -> "dummy03"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0APlan: 3 to add, 2 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```